package leetcode.editor.cn;

import com.alibaba.fastjson.JSON;

/**
 * 题目：买卖股票的最佳时机 II
 * 题目编号：122
 * 时间：2023-09-03 20:46:58
 * 通过：？
 */
public class BestTimeToBuyAndSellStockIi {
    public static void main(String[] args) {
        Solution solution = new BestTimeToBuyAndSellStockIi().new Solution();

    }

    //leetcode submit region begin(Prohibit modification and deletion)
    class Solution {
        public int maxProfit(int[] prices) {
            int length = prices.length;
            // dp[i][0] 表示第i天手上没有股票所获得的最大收益
            // dp[i][1] 表示第i天手上有股票所获得的最大收益
            int[][] dp = new int[length][2];
            // 第0天（其实是第一天），不购买股票
            dp[0][0] = 0;
            // 第0天，购买股票，那么收益即是负的第0天的价格
            dp[0][1] = -prices[0];

            for (int i = 1; i < length; i++) {
                /**
                 * 1.第i天手上没有股票，即在这一天卖出，或再此之前已经卖出，则收益等与：
                 *   第i-1天的收益（手上没有股票，在第i天之前已经卖掉了）和 第i-1天的收益加上第i天的股价（手上有股票，第i天卖掉）
                 * 2.第i天手上有股票，即再此之前已经买入，或者在第i天买入，则收益等与：
                 *   第i-1天的的收益（在第i天之前已经买入）和第i-1天的收益减去第i天的股价（在第i天买入）
                 */

                dp[i][0] = Math.max(dp[i - 1][0], dp[i - 1][1] + prices[i]);
                // 题目只允许买卖一次，当购买时，即是第一次购买
                dp[i][1] = Math.max(dp[i - 1][1], dp[i - 1][0] - prices[i]);
            }

            System.out.println("dp = " + JSON.toJSONString(dp));
            return dp[length - 1][0];

        }
    }
//leetcode submit region end(Prohibit modification and deletion)

}


//给你一个整数数组 prices ，其中 prices[i] 表示某支股票第 i 天的价格。 
//
// 在每一天，你可以决定是否购买和/或出售股票。你在任何时候 最多 只能持有 一股 股票。你也可以先购买，然后在 同一天 出售。 
//
// 返回 你能获得的 最大 利润 。 
//
// 
//
// 示例 1： 
//
// 
//输入：prices = [7,1,5,3,6,4]
//输出：7
//解释：在第 2 天（股票价格 = 1）的时候买入，在第 3 天（股票价格 = 5）的时候卖出, 这笔交易所能获得利润 = 5 - 1 = 4 。
//     随后，在第 4 天（股票价格 = 3）的时候买入，在第 5 天（股票价格 = 6）的时候卖出, 这笔交易所能获得利润 = 6 - 3 = 3 。
//     总利润为 4 + 3 = 7 。 
//
// 示例 2： 
//
// 
//输入：prices = [1,2,3,4,5]
//输出：4
//解释：在第 1 天（股票价格 = 1）的时候买入，在第 5 天 （股票价格 = 5）的时候卖出, 这笔交易所能获得利润 = 5 - 1 = 4 。
//     总利润为 4 。 
//
// 示例 3： 
//
// 
//输入：prices = [7,6,4,3,1]
//输出：0
//解释：在这种情况下, 交易无法获得正利润，所以不参与交易可以获得最大利润，最大利润为 0 。 
//
// 
//
// 提示： 
//
// 
// 1 <= prices.length <= 3 * 10⁴ 
// 0 <= prices[i] <= 10⁴ 
// 
//
// Related Topics 贪心 数组 动态规划 👍 2234 👎 0
